Repository: BenAshkenazi/MobileHealth
Catalog: MobileHealthApp/*.lproj/Localizable.strings
Languages: es

source: Anywhere
es: Dondequiera

source: Search
es: Búsqueda

source: Who does CTC provide care for?
es: ¿A quién atiende CTC?

source: Individuals of all ages facing homelessness.
es: Individuos de todas las edades que se enfrentan a la falta de vivienda.

source: Is CTC a “free clinic”?
es: ¿Es el CTC una clínica gratuita?

source: No. CTC is a federally qualified community health center (FQHC) and will bill patients’ insurances for services provided. Many individuals facing homelessness are insured by AHCCCS, the state’s Medicaid system.
es: No. CTC es un centro de salud comunitario calificado federalmente (FQHC) y facturará a los seguros de los pacientes por los servicios prestados. Muchas personas que se encuentran sin hogar están aseguradas por AHCCCS, el sistema de Medicaid del estado.

source: What if a person is uninsured?
es: ¿Qué pasa si una persona no tiene seguro?

source: Most individuals facing homelessness that are not insured qualify for the CTC sliding fee discount scale. Those patients may receive their care at no cost or for a small fee depending on income.
es: La mayoría de las personas sin hogar que no están aseguradas califican para la escala de descuento de tarifas móviles de CTC. Esos pacientes pueden recibir su atención sin costo o por una pequeña tarifa dependiendo de los ingresos.

source: What happens if a person who is not homeless seeks care from CTC?
es: ¿Qué sucede si una persona que no es desamparada busca atención de CTC?

source: If the patient is seeking acute care, the medical need will be addressed and the patient will be assisted in establishing care at another health center. If the patient intends to establish care or is seeking preventative care, the patient will be assisted in making a future appointment with another health center.
es: Si el paciente busca atención aguda, se abordará la necesidad médica y se ayudará al paciente a establecer la atención en otro centro de salud. Si el paciente tiene la intención de establecer atención o está buscando atención preventiva, el paciente será asistido para hacer una cita futura con otro centro de salud.

source: What other services can I receive at CTC?
es: ¿Qué otros servicios puedo recibir en CTC?

source: Circle the City offers integrated health care services that include behavioral health, additionally our clinics also have patient navigation services to assist patients in coordinating their care, connection to resources, and much more.
es: Circle the City ofrece servicios integrados de atención médica que incluyen salud conductual; además, nuestras clínicas también tienen servicios de navegación para pacientes para ayudar a los pacientes a coordinar su atención, conexión a recursos y mucho más.

source: Have you been to the hospital recently?
es: ¿Has estado en el hospital recientemente?

source: If you were recently discharged from a hospital please bring in your records or notify the clinic you were recently discharged and provide the hospital information. By providing this information to us, we can begin to obtain hospital records and have them available prior to your visit.
es: Si fue dado de alta recientemente de un hospital, traiga sus registros o notifique a la clínica que fue dado de alta recientemente y proporcione la información del hospital. Al brindarnos esta información, podemos comenzar a obtener registros del hospital y tenerlos disponibles antes de su visita.

source: Do I need to schedule an appointment to receive care in one of CTC’s Mobile Medical Care Units?
es: ¿Necesito programar una cita para recibir atención en una de las Unidades Móviles de Atención Médica de CTC?

source: No. Our Mobile Medical Care Units operate on a walk-in basis, an appointment is never required.
es: No. Nuestras Unidades Móviles de Atención Médica funcionan sin cita previa, nunca se requiere una cita.

source: Are you concerned about transportation?
es: ¿Estás preocupada por el transporte?

source: Good news, transportation services are covered through AHCCCS. Contact your health plan 72 hours in advance to arrange a ride. If you do not qualify for transportation, please contact us and will make every attempt to make accommodations if possible.
es: Buenas noticias, los servicios de transporte están cubiertos por AHCCCS. Comuníquese con su plan de salud con 72 horas de anticipación para programar un viaje. Si no califica para el transporte, comuníquese con nosotros y haremos todo lo posible para hacer las adaptaciones posibles.

source: What if I don’t speak English?
es: ¿Qué pasa si no hablo inglés?

source: Many of our staff members are bilingual in Spanish and if you speak another language, we have interpretation services available through a third party.
es: Muchos de los miembros de nuestro personal son bilingües en español y si habla otro idioma, tenemos servicios de interpretación disponibles a través de un tercero.
